jobs/container/0_orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|                  |                                                          |
|   F ield         | FOAM:     The Open Source CFD Toolbox                    |
|   O peration     | Version:  2.1.0                                          |
|   A nd           | Web:      http://www.OpenFOAM.org                        |
|   M anipulation  |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    "inlet1_.*"
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.003;
        value           uniform 1.0;
    }
    "outlet1_.*"
    {
        type            zeroGradient;
    }
    "walls_.*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
