jobs/container/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (0.0  -0.11  -0.06)
    (0.28  -0.11  -0.06)
    (0.28  0.27  -0.06)
    (0.0  0.27  -0.06)
    (0.0  -0.11  0.231)
    (0.28  -0.11  0.231)
    (0.28  0.27  0.231)
    (0.0  0.27  0.231)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (150 150 150) simpleGrading (1.0 1.0 1.0)
);

edges           
(
);

patches         
(
    patch maxY 
    (
        (3 7 6 2)
    )
    patch minX
    (
        (0 4 7 3)
    )
    patch maxX
    (
        (2 6 5 1)
    )
    patch minY
    (
        (1 5 4 0)
    )
    patch minZ
    (
        (0 3 2 1)
    )
    patch maxZ
    (
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
 
